Repository: sergioemv/bin.dev.donet.CaseMaker
Catalog: CaseMakerLOC/Resources.*.resx
Languages: de_de, es_es

# DefaultDao_AddNew_ErrorSaving
source: Error Saving Item
es_es: Error Guardando Item

# DefaultDao_GetItem_ErrorGetting
source: Error Getting Item
es_es: Error Obteniendo Item

# AbstractCombinationGenerator_ValidateModel_Dependency
source: The dependency is needed to generate the combinations
es_es: La dependencia es necesaria para generar las combinaciones

# AbstractCombinationGenerator_ValidateModel_ElementsNeeded
source: The dependency needs at least 2 elements to generate combinations
es_es: La dependencia necesita al menos 2 elementos para generar combinaciones

# AbstractCombinationGenerator_ValidateModel_MaximalNumberOfCombHigh
source: The maximal number of combinations must be higher than zero
es_es: El numero maximo de combinaciones debe ser mayor a cero

# AbstractCombinationGenerator_ValidateModel_NeededEquivalenceClasses
source: The dependency needs at least 2 selected equivalence classes from different elements
es_es: La dependencia necesita al menos 2 clases de equivalencia seleccionadas de elementos distintos

# PermutationCombinationGenerator_ValidateModel_Error
source: The number of combinations to be generated is higher than the allowed maximal number of combinations
es_es: El número de combinaciones a ser generada es mayor al máximo número permitido de combinaciones

# PresentationLayer_TestCase_Element_Description
source: Description
de_de: DescriptionGE
es_es: Descripción

# PresentationLayer_TestCase_Element_Name
source: Element
de_de: ElementGE
es_es: Elemento

# PresentationLayer_TestCase_Element_ObjectTypes
source: ObjectTypes
de_de: ObjectTypesGE
es_es: TiposDeObjeto

# PresentationLayer_TestCase_EquivalenceClass_Description
source: Description
es_es: Descripción

# PresentationLayer_TestCase_EquivalenceClass_Effects
source: Effects
es_es: Effectos

# PresentationLayer_TestCase_EquivalenceClass_State
source: S
es_es: E

# PresentationLayer_TestCase_EquivalenceClass_Value
source: Value
es_es: Valor

# PresentationLayer_General_Failure
source: Failure
es_es: Falla

# PresentationLayer_General_Irrelevant
source: Irrelevant
es_es: Irrelevante

# PresentationLayer_General_Negative
source: Negative
de_de: Negativ
es_es: Negativo

# PresentationLayer_General_Positive
source: Positive
de_de: Positiv
es_es: Positivo

# PresentationLayer_WorkSpace_Project_TestObject_Effect_AddResult
source: Add Expected Result
de_de: Addieren Sie Erwartetes Resultat
es_es: Añadir Resultado Esperado

# PresentationLayer_WorkSpace_Project_TestObject_Effect_ExpectedResults
source: Expected Results
de_de: Sollergebnisse
es_es: Resultados Esperados

# PresentationLayer_WorkSpace_Project_TestObject_Effect_RemoveResults
source: Remove Expected Result
de_de: Entfernen Sie Erwartetes Resultat
es_es: Remover Resultado Esperado

# PresentationLayer_WorkSpace_Project_TestObject_Requirements_Add
source: Add Requirement
de_de: Addieren Sie Anforderung
es_es: Añadir Requerimiento

# PresentationLayer_WorkSpace_Project_TestObject_Requirements_Assigned
source: Assigned Requirements
de_de: Zugewiesene Anforderungen
es_es: Requerimientos Asignados

# PresentationLayer_WorkSpace_Project_TestObject_Requirements_ErrorMsg
source: Requirement already exists
de_de: Anforderung ist bereits vorhanden
es_es: El requerimiento ya existe.

# PresentationLayer_WorkSpace_Project_TestObject_Requirements_New
source: New Requirement
de_de: Neue Anforderung
es_es: Nuevo Requerimiento

# PresentationLayer_WorkSpace_Project_TestObject_Requirements_Remove
source: Remove Requirement
de_de: Entfernen Sie Anforderung
es_es: Remover Requerimiento

# PresentationLayer_WorkSpace_Project_TestObject_Requirements_Requirements
source: Requirements
de_de: Anforderungen
es_es: Requerimientos

# PresentationLayer_WorkSpace_Project_TestObject_EquivalenceTab_Effects
source: Effects
de_de: Wirkungen
es_es: Efectos

# PresentationLayer_WorkSpace_Project_TestObject_EffectTab_Requirements
source: Requirements
de_de: Anforderungen
es_es: Requerimientos

# PresentationLayer_WorkSpace_Project_TestObject_EffectTab_ExpResults
source: Expected Results
de_de: Sollergebnisse
es_es: Resultados Esperados

# PresentationLayer_WorkSpace_Project_TestObject_Dependencies_Description
source: Description
de_de: Beschreibung
es_es: Descripcion

# PresentationLayer_WorkSpace_Project_TestObject_Dependencies_Name
source: Dependency
de_de: Abh\u00E4ngigkeit
es_es: Dependencia

# PresentationLayer_WorkSpace_Project_TestObject_Dependencies_CreateInfo
source: Number of dependent elements must be at least 2.
de_de: Die Anzahl der abh\u00E4ngigen Elemente muss 2 oder gr\u00F6\u00DFer sein.
es_es: El numero de Elementos dependientes debe ser mayor o igual a 2.

# PresentationLayer_WorkSpace_Project_TestObject_Combination_AllPairsOrigin
source: Generated by All Pairs Algorithm
de_de: Generiert nach dem Algorithmus der Allen Paaren
es_es: Generada por el algoritmo de All Pairs

# PresentationLayer_WorkSpace_Project_TestObject_Combination_ManualOrigin
source: Manually added
de_de: Manuell angeh\u00E4ngt
es_es: Añadida manualmente

# PresentationLayer_WorkSpace_Project_TestObject_Combination_PermutationOrigin
source: Generated by Permutation
de_de: Generiert nach Permutation
es_es: Generada por Per

# PresentationLayer_Button_ToolTip_Combinations_GenerateCombinations_ByAllPair
source: Generate Combinations by All Pairs Algorithm...
de_de: Kombinationen durch den AllPairs-Algorithmus erzeugen...
es_es: Generar Combinaciones por el algoritmo AllPairs...

# PresentationLayer_Button_ToolTip_Combinations_GenerateCombinations_ByPermutation
source: Generate Combinations by Permutation...
de_de: Kombinationen durch Permutation erzeugen...
es_es: Generar Combinaciones por permutaci\u00F3n...

# PresentationLayer_Button_ToolTip_Combinations_Merge
source: Merge Combination
de_de: Kombinationen zusammenlegen
es_es: Fusionar Combinación

# PresentationLayer_Button_ToolTip_Combinations_SeparateMerge
source: Separate Combination
de_de: Kombinationen trennen
es_es: Separar Combinación

# PresentationLayer_Button_ToolTip_Dependency_Create
source: Create Dependency
de_de: Abh\u00E4ngigkeit erstellen
es_es: Crear Dependencia...

# PresentationLayer_Button_ToolTip_Dependency_Delete
source: Delete Dependency
de_de: Abh\u00E4ngigkeit l\u00F6schen
es_es: Eliminar Dependencia...

# PresentationLayer_Button_ToolTip_Dependency_Edit
source: Edit Dependency
de_de: Abh\u00E4ngigkeit bearbeiten
es_es: Editar Dependencia...

# PresentationLayer_Button_ToolTip_Combinations_Create
source: Create a new Combination
de_de: Kombination erzeugen
es_es: Crear Combinación...

# PresentationLayer_Button_ToolTip_Combinations_Delete
source: Delete the selected Combination
de_de: Ausgew\u00E4hlte Kombination l\u00F6schen
es_es: Eliminar Combinación

# PresentationLayer_Button_ToolTip_Combinations_Edit
source: Edit Combination...
de_de: Kombination bearbeiten
es_es: Editar Combinación...

# PresentationLayer_WorkSpace_Project_TestObject_Dependencies_DependentElements
source: --> Dependent Elements:
de_de: --> Abh\u00E4ngiges Element:
es_es: --> Elementos Dependientes:

# PresentationLayer_WorkSpace_Project_TestObject_Combination_ErrorMsg
source: The combination already exists\! Please try to create another one, that does not already exist.
de_de: Die Kombination existiert bereits\! Bitte versuchen Sie eine nicht bereits existierende Kombination zu bilden.
es_es: Combinación ya existe\!. Por favor trate de formar una que ya no exista.

# PresentationLayer_Button_Cancel
source: Cancel
de_de: Abbrechen
es_es: Cancelar

# PresentationLayer_Button_Ok
source: OK
es_es: Aceptar

# PresentationLayer_WorkSpace_Project_TestObject_EquivalenceTab_General
source: General
de_de: Allgemein

# PresentationLayer_WorkSpace_Project_TestObject_EffectTab_General
source: General
de_de: Allgemein
